#조건1 : 내가 가진 돈이 5000이상
#조건2 : 행사 시간이 14~18시 사이
#조건1,2 만족하면 1+1 행사 상품을 받습니다! 아니면 1개만 정가로 구매합니다 출력

# money = int(input("현재 가진 돈을 숫자로 입력하세요 (예 : 6000) : "))
# time = int(input("현재 시간을 입력하세요 (예 : 14, 15 같은 숫자) : "))

# if money>=5000 and (time >= 14 or time < 18):
#     print("1+1 행사 상품을 받습니다!")
# else:
#     print("1개만 정가로 구매합니다.")

# money = int(input("현재 가진 돈을 숫자로 입력하세요 (예 : 6000) : "))
# time = int(input("현재 시간을 입력하세요 (예 : 14, 15 같은 숫자) : "))
# is_event_time = (14 <= time <= 18)


# if money>=5000 and is_event_time:
#     print("1+1 행사 상품을 받습니다!")
# else:
#     print("1개만 정가로 구매합니다.")



#or 문제
#조건1: 내가 vip 회원이다
#조건2: 친구 추천으로 받은 쿠폰이 있다
#조건1,2 만족하면 할인 쿠폰이 적용됩니다, 아니면 할인 없이 정가로 결제합니다 출력

is_vip = true